# **SQL Database**

_John Andrew Dixon_

---

##### **Imports**

In [148]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists

##### **Data Load**

In [149]:
# Make it so that all of the dataframe's columns are shown
pd.set_option('display.max_columns', None)

In [150]:
title_basics_df = pd.read_csv("Data/title_basics.csv.gz")
title_basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [151]:
title_ratings_df =  pd.read_csv("Data/title_ratings.csv.gz")
title_ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       263
2  tt0000005            6.2      2607
3  tt0000006            5.2       181
4  tt0000007            5.4       816

In [152]:
TMDb_API_df = pd.read_csv("Data/tmdb_results_combined.csv.gz")
TMDb_API_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,3.737,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,Earth is in a state of constant war and two co...,2.184,/h9bWO13nWRGZJo4XVPiElXyrRMU.jpg,"[{'id': 7405, 'logo_path': '/rfnws0uY8rsNAsrLb...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-11-15,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,"After falling prey to underworld, four friends...",0.890,/yB5wRu4uyXXwZA3PEj8cITu0xt3.jpg,[],"[{'iso_3166_1': 'IN', 'name': 'India'}]",2000-04-14,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,Two neighbors become intimate after discoverin...,22.604,/iYypPT4bhqXfq1b6EnmxvRt6b2Y.jpg,"[{'id': 539, 'logo_path': '/iPLtePguIzOPNtAWfT...","[{'iso_3166_1': 'FR', 'name': 'France'}, {'iso...",2000-09-29,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.114,2188.0,PG

---

## **Database Creation**

In [153]:
# Format the connection to make
connection = "mysql+pymysql://root:root@localhost/movies"

In [154]:
# Create the connection engine
engine = create_engine(connection)

In [155]:
# Check if the database exists
if database_exists(connection):
    # Notify that the database exists
    print(f"The movies database exists!")
else:
    create_database(connection)

The movies database exists!

## **Table Creation**

##### **_title_ratings_**

In [156]:
# View Datatype info about the ratings DataFrame
title_ratings_df.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [157]:
# Get the max length of the primary key "tconst"
key_len = title_ratings_df["tconst"].fillna("").map(len).max()

# Create the ratings schema
ratings_schema = {
    "tconst": String(key_len + 1),
    "averageRating": Float(),
    "numVotes": Integer()
}

In [158]:
# Actually create the ratings table in the database
title_ratings_df.to_sql("title_ratings",
                  engine,
                  dtype=ratings_schema,
                  if_exists="replace",
                  index=False)

496798

In [159]:
# Set "tconst" as the primary key
engine.execute("ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);");

In [174]:
# View the schema to verify the primary key was added
query = """DESCRIBE title_ratings;"""
pd.read_sql(query, engine)

           Field         Type Null  Key Default Extra
0         tconst  varchar(11)   NO  PRI    None
1  averageRating        float  YES         None
2       numVotes          int  YES         None

In [175]:
query = """
SELECT * FROM title_ratings
LIMIT 5;
"""
pd.read_sql(query, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       263
2  tt0000005            6.2      2607
3  tt0000006            5.2       181
4  tt0000007            5.4       816

##### **_title_genres_**

In [161]:
# Split genres in the basics dataframe
title_basics_df["genres_split"] = title_basics_df["genres"].str.split(",")
# Explode the genres and get the unique values
unique_genres = sorted(title_basics_df["genres_split"].explode().unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [162]:
# Explode the "genres_split" column
title_genres_df = title_basics_df.explode("genres_split")
# Get all the rows but only the "genres_split" and "tconst"
title_genres_df = title_genres_df[["tconst", "genres_split"]]
title_genres_df.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [163]:
# Rename the column to reflect the futue genre_id that'll replace the genre name
title_genres_df.rename(columns={"genres_split": "genre_id"}, inplace=True)
title_genres_df.head()

      tconst genre_id
0  tt0035423   Comedy
0  tt0035423  Fantasy
0  tt0035423  Romance
1  tt0062336    Drama
2  tt0069049    Drama

In [164]:
# Create a genre map
genre_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [165]:
title_genres_df["genre_id"] = title_genres_df["genre_id"].map(genre_map)
title_genres_df.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [166]:
# Actually create the ratings table in the database
title_genres_df.to_sql("title_genres",
                        engine,
                        if_exists="replace",
                        index=False)

161676

In [167]:
# View the schema to verify the primary key was added
query = """DESCRIBE title_genres;"""
pd.read_sql(query, engine)

      Field    Type Null Key Default Extra
0    tconst    text  YES        None
1  genre_id  bigint  YES        None

In [176]:
query = """
SELECT * FROM title_genres
LIMIT 5;
"""
pd.read_sql(query, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

##### _genres_

In [168]:
# Make the genre map into a dataframe
genres_df = pd.DataFrame({
    "genre_id": genre_map.values(),
    "genre_name": genre_map.keys()
})

In [169]:
# Add the table to the database
genres_df.to_sql("genres",
                 engine,
                 index=False)

26

In [170]:
# Set "tconst" as the primary key
engine.execute("ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);");

In [171]:
# View the schema to verify the primary key was added
query = """DESCRIBE genres;"""
pd.read_sql(query, engine)

        Field    Type Null  Key Default Extra
0    genre_id  bigint   NO  PRI    None
1  genre_name    text  YES         None

In [177]:
query = """
SELECT * FROM genres
LIMIT 5;
"""
pd.read_sql(query, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

##### _tmdb_data_

In [182]:
# Extract only the relevant columns
TMDb_API_df = TMDb_API_df[["imdb_id", "revenue", "budget", "certification"]]
TMDb_API_df.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [183]:
# Get the datatypes of each column
TMDb_API_df.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object